[
 {
   "id": 3201,
   "name": "Kubota JSON OEM Part - 70000-43081 Filter, Fuel (REPLACEMENT: 15221-43170)",
   "description": "Ensure optimal performance of your Kubota equipment with the Kubota OEM Part - 70000-43081 Filter, Fuel (REPLACEMENT: 15221-43170). This high-quality filter is designed to effectively remove contaminants and impurities from your fuel, keeping your engine running smoothly. Trust in Kubota genuine parts for durability and reliability. Don't settle for anything less than the best for your Kubota machine. Invest in the Kubota OEM Part - 70000-43081 Filter, Fuel (REPLACEMENT: 15221-43170) today. Keywords: Kubota, OEM part, 70000-43081, filter, fuel, replacement, 15221-43170, contaminants, impurities, engine, durability, reliability.",
   "price": "4,258",
   "imageUrls": "https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg",
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3202,
   "name": "Loctite SF 7649 Primer and Cleaner 4.5 OZ",
   "description": "Loctite SF 7649 Primer and Cleaner 4.5 OZ is a powerful solution for preparing surfaces before bonding. This versatile product ensures maximum adhesion and durability for a wide range of materials. Ideal for industrial, automotive, and household use, Loctite SF 7649 effectively removes grease, oil, and dirt while promoting strong bonds. Trust Loctite for reliable results every time. Purchase your Loctite SF 7649 Primer and Cleaner 4.5 OZ today and experience the difference. Keywords: Loctite, SF 7649, Primer, Cleaner, 4.5 OZ, adhesion, durability, industrial, automotive, household.",
   "price": "3,640",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3203,
   "name": "LOCTITE 620 50ML",
   "description": "The LOCTITE 620 50ML is a high-strength, fast-curing adhesive ideal for bonding metal surfaces. This versatile product provides excellent chemical and temperature resistance, making it perfect for industrial applications. With its easy-to-use syringe applicator, you can quickly and efficiently apply the adhesive exactly where you need it. Trust LOCTITE 620 50ML for strong, reliable bonds that stand the test of time. Purchase yours today and experience the superior performance for yourself.\n\nKeywords: LOCTITE 620, 50ML, high-strength adhesive, metal bonding, chemical resistance, temperature resistance, industrial applications, syringe applicator, reliable bonds, superior performance.",
   "price": "3,435",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3204,
   "name": "CRAFTSMAN CMMT87010 7-Piece SAE",
   "description": "The CRAFTSMAN CMMT87010 7-Piece SAE set is a must-have for any mechanic or DIY enthusiast. This high-quality set includes all the essential SAE sizes, ensuring you have the right tool for any job. Each piece is crafted from durable chrome vanadium steel for long-lasting performance. The sockets feature a 6-point design for a secure grip on fasteners, preventing rounding and stripping. This versatile set comes in a convenient storage case for easy organization and transportation. Upgrade your toolbox with the CRAFTSMAN CMMT87010 7-Piece SAE set today!\n\nKeywords: CRAFTSMAN, CMMT87010, 7-Piece, SAE, mechanic, DIY, chrome vanadium steel, 6-point design, storage case, toolbox.",
   "price": "12,105",
  "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3205,
   "name": "DISEN 13 Pieces Hex Key Allen Wrench Set Metric Size with Ball End, 1.27-10 MM ( HEX SET 13P)",
   "description": "The DISEN 13 Pieces Hex Key Allen Wrench Set Metric Size with Ball End is a must-have tool for any DIY enthusiast or professional mechanic. This set includes sizes ranging from 1.27 to 10mm, ensuring you have the right tool for any job. The ball end design allows for easy access to hard-to-reach areas, making tasks a breeze. Made of high-quality materials, these hex keys are durable and built to last. Say goodbye to stripped screws and frustration with this reliable and versatile HEX SET 13P. Order yours today and tackle any project with ease. \n\nKeywords: DISEN, Hex Key Allen Wrench Set, Metric Size, Ball End, 1.27-10mm, HEX SET 13P, DIY, mechanic, durable, versatile.",
   "price": "2,905",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3206,
   "name": "RIDGID 47057 ,12\" Aluminum Straight Pipe Wrench",
   "description": "The RIDGID 47057 12\" Aluminum Straight Pipe Wrench is a durable and reliable tool for all your plumbing needs. Made of high-quality aluminum, this wrench is lightweight yet strong, making it easy to use for extended periods. The straight design allows for easy access to tight spaces, while the precision-machined jaws provide a secure grip on pipes. With its ergonomic handle and smooth adjustment mechanism, this wrench is a must-have for any professional plumber or DIY enthusiast. Trust in RIDGID for all your pipe wrench needs. Keywords: RIDGID 47057, 12\", Aluminum, Straight, Pipe Wrench, durable, lightweight, precision-machined, ergonomic, plumber, DIY.",
   "price": "11,670",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3207,
   "name": "17123-63016 STARTER KUBOTA IMPORTED FROM JAPAN",
   "description": "Introducing the 17123-63016 Starter Kubota, imported directly from Japan. This high-quality starter is designed for optimal performance and durability, ensuring your Kubota equipment starts reliably every time. Say goodbye to frustrating delays and get back to work with ease. Trust in the superior craftsmanship of this authentic Japanese import. Order yours today and experience the difference. Kubota starter, imported from Japan, high-quality, reliable, durable, authentic, craftsmanship, equipment, performance, optimal.",
   "price": "86,605",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3208,
   "name": "Industrial Scientific 17124975-2 MX6 iBrid H2S Sensor,",
   "description": "The Industrial Scientific 17124975-2 MX6 iBrid H2S Sensor is a reliable and accurate tool for detecting hydrogen sulfide gas in industrial settings. With advanced technology and easy-to-read display, this sensor provides real-time data to ensure safety in hazardous environments. Its durable construction and long battery life make it ideal for continuous monitoring. Trust the Industrial Scientific 17124975-2 MX6 iBrid H2S Sensor for all your gas detection needs. Purchase yours today and stay protected. Keywords: Industrial Scientific, MX6 iBrid, H2S Sensor, hydrogen sulfide gas, industrial settings, real-time data, hazardous environments, continuous monitoring, gas detection, safety.",
   "price": "63,866",
  "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3209,
   "name": "ISC Internal Water & Dust Filter for Ventis Series and MX6 iBrid Pumps | Mfg# 17058157\n",
   "description": "The ISC Internal Water & Dust Filter for Ventis Series and MX6 iBrid Pumps, Mfg# 17058157, ensures optimal performance by keeping out debris and moisture. This durable filter is easy to install and maintain, extending the life of your equipment. Trust ISC for reliable protection in harsh environments. Shop now for this essential accessory. Keywords: ISC, Internal Water & Dust Filter, Ventis Series, MX6 iBrid Pumps, Mfg# 17058157, debris protection, moisture resistance, easy installation, equipment maintenance, reliable performance.",
   "price": "2,155",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3210,
   "name": "General Electric GE 44043 - LU150",
   "description": "The General Electric GE 44043 - LU150 is a high-quality, energy-efficient light bulb designed to provide bright and long-lasting illumination. This 150-watt bulb is perfect for outdoor lighting applications, such as streetlights or security lights. With its durable construction and reliable performance, the GE 44043 - LU150 is a cost-effective lighting solution for any commercial or residential setting. Trust in General Electric's reputation for excellence and choose the GE 44043 - LU150 for all your lighting needs.\n\nKeywords: General Electric, GE 44043, LU150, energy-efficient, bright, long-lasting, outdoor lighting, commercial, residential, cost-effective.",
   "price": "4,830",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3211,
   "name": "Fisher 11B4040X012\n",
   "description": "Introducing the Fisher 11B4040X012, a top-of-the-line product designed for maximum performance and durability. This versatile tool is perfect for a wide range of applications, from DIY projects to professional construction work. With its sleek design and high-quality materials, the Fisher 11B4040X012 is built to last. Say goodbye to flimsy tools that break easily - invest in the Fisher 11B4040X012 for reliable results every time. Don't miss out on this must-have addition to your toolkit. Order yours today and experience the difference for yourself.\n\nKeywords: Fisher, 11B4040X012, performance, durability, versatile, construction, high-quality, reliable, toolkit, must-have.",
   "price": "11,295",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3212,
   "name": "8577 3M USA PACK of 10",
   "description": "Introducing the 8577 3M USA Pack of 10, a high-quality product designed for durability and performance. This pack includes 10 top-of-the-line products from 3M, a trusted brand known for its reliability. Ideal for a wide range of applications, these products are perfect for both professional and DIY projects. Made in the USA, you can trust the quality and craftsmanship of each item in this pack. Upgrade your toolkit today with the 8577 3M USA Pack of 10.\n\nKeywords: 8577, 3M, USA, pack, 10, high-quality, durability, performance, professional, DIY.",
   "price": "8,330",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3213,
   "name": "8577CN 3M CHINA PACK of 10",
   "description": "Introducing the 8577CN 3M China Pack of 10, a must-have for all your packaging needs. These high-quality adhesive strips are durable and reliable, ensuring your packages stay secure during transit. Perfect for both personal and professional use, these versatile strips are easy to use and provide a strong hold. Say goodbye to worries about your packages getting damaged in the mail. Invest in the 8577CN 3M China Pack of 10 today and experience peace of mind with every shipment. Order now and protect your packages with confidence. 3M, China, pack, adhesive, strips, durable, reliable, secure, transit, versatile.",
   "price": "11,370",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3214,
   "name": "ENP6202\nCrouse Hinds Plugs & Receptacles\n",
   "description": "Introducing the ENP6202 Crouse Hinds Plugs & Receptacles, a reliable and durable solution for all your electrical needs. Designed for maximum safety and efficiency, these plugs and receptacles are perfect for industrial and commercial applications. With easy installation and a sturdy construction, you can trust the ENP6202 to deliver consistent performance every time. Upgrade your electrical system with these high-quality Crouse Hinds products today.\n\nKeywords: ENP6202, Crouse Hinds, Plugs, Receptacles, electrical, industrial, commercial, safety, efficiency, installation.",
   "price": "36,530",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3215,
   "name": "Schneider Electric\nLV434211",
   "description": "The Schneider Electric LV434211 is a high-performance circuit breaker, designed for optimal protection and control in industrial applications. With advanced features such as adjustable thermal and magnetic settings, this breaker ensures reliable operation and safety. Its compact design allows for easy installation and maintenance, saving time and effort. Trust Schneider Electric for quality and efficiency in your electrical systems. Keywords: Schneider Electric, LV434211, circuit breaker, industrial applications, adjustable settings, reliable operation, safety, compact design, easy installation, maintenance.",
   "price": "13,787",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3216,
   "name": "DX4816-6000 PELCO Discontinued",
   "description": "The DX4816-6000 PELCO Discontinued is a high-quality surveillance system with advanced features for maximum security. This product offers exceptional video quality and performance, making it ideal for monitoring various environments. With its user-friendly interface and reliable functionality, the DX4816-6000 ensures seamless operation and peace of mind. Don't miss out on this discontinued model, get yours today. Keywords: DX4816-6000, PELCO, Discontinued, surveillance system, video quality, security, user-friendly, interface, functionality, reliable.",
   "price": "",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3217,
   "name": "SP Bel-Art Write-On Label Tape Rainbow Multi-Pack; 40yd Length, ³/₄ in. Width, 3 in. Core (Pack of 6) (F13463-0600)",
   "description": "The SP Bel-Art Write-On Label Tape Rainbow Multi-Pack is perfect for color-coding and organizing your workspace. This pack includes six rolls of label tape in assorted colors, each with a length of 40 yards, a width of ¾ inch, and a 3-inch core. The tape is easy to write on and can be quickly applied to a variety of surfaces. Stay organized and efficient with this convenient labeling solution. Keywords: SP Bel-Art, Write-On, Label Tape, Rainbow, Multi-Pack, Color-Coding, Organizing, Workspace, Assorted Colors, Easy to Write On.",
   "price": "17,635",
 "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 },
 {
   "id": 3218,
   "name": "VWR TAPE WHT 1/2X500 PK6RL        89097-916\nVWR TAPE GRN 1/2X500 PK6RL        89097-930\nVWR TAPE YEL 1/2X500 PK6RL        89097-928\nVWR tape red   1/2X500 PK6RL        89097-932",
   "description": "Introducing VWR Tape in white, green, yellow, and red. Each pack contains 6 rolls measuring 1/2\" x 500\". Perfect for labeling, organizing, and sealing. These high-quality tapes are durable and long-lasting. Ideal for use in laboratories, classrooms, offices, and more. Get your hands on these versatile tapes today and streamline your work processes. VWR Tape White 1/2X500 PK6RL 89097-916, VWR Tape Green 1/2X500 PK6RL 89097-930, VWR Tape Yellow 1/2X500 PK6RL 89097-928, VWR Tape Red 1/2X500 PK6RL 89097-932. Order now and experience the convenience of VWR Tape.",
   "price": "108,140",
   "imageUrls": ["https://m.media-amazon.com/images/I/61gVmE-RWgL._SL1498_.jpg"],
   "category": "Industrial Chemicals",
   "keywords": []
 }
]